Lewandowski-JKL/recirculador_lpc804/include/board_defs.h
/**
 * @file board_defs.h
 * @author Jackson Kenedi Lewandowski (jacksonleandowski.work@gmail.com)
 * @brief 
 * @version 0.1
 * @date 2026-02-20
 * 
 * @copyright Copyright (c) 2026
 * 
 */
#ifndef BOARD_DEFS_H
#define BOARD_DEFS_H

#define __LPC804__
#define __RECIRCULADOR__

#ifdef __RECIRCULADOR__
/*******************************************************************************
 * TIME definitions
 ******************************************************************************/
#define SysTickFrequency        (10000U)
#define SysTicksToProcess       (SysTickFrequency/1000U)   
#define SysTicks10_ms           (SysTickFrequency/100U)  
#define SysTicks100_ms          (SysTickFrequency/10U)  
#define SysTicks200_ms          (2U*SysTicks100_ms)
#define SysTicks500_ms          (5U*SysTicks100_ms)
#define SysTicks1000_ms         (SysTickFrequency/1U)  
#define SysTicks2000_ms         (2U*SysTicks1000_ms)   
#define SysTicks5000_ms         (5U*SysTicks1000_ms)
#define SysTicksButtonDebounce  (5U)
/*******************************************************************************
 * Project Definitions
 *****************************************************************************/
#define SysRecirculationTicks   (30*SysTicks1000_ms)   
#define SysRecirculationTime_ms (30000)   


/*******************************************************************************
 * Communication Definitions (I2C)
 *****************************************************************************/
#define SysI2CBaudRate          (400000)//400 KHz
#define SysI2CBufferSize        (255)
#define SysI2CADDR_WiFi         (0x01)
#define SysI2CADDR_Recirculador (0x02)

/*******************************************************************************
 * EEPROM Definitions (Flash)
 *****************************************************************************/
#define SysEepromSize       (0x800)
/*é utilizado uint8_t pq estamos nos referenciando a um endereço de memória*/
extern unsigned char __flash_end;
extern unsigned char __eeprom_start;
extern unsigned char __app1_start;
extern unsigned char __app1_end;
extern unsigned char __app2_start;
extern unsigned char __app2_end;

/*******************************************************************************
 * ADC Definitions
 *****************************************************************************/
#define SysADCTicksToRead   (SysTicks10_ms)
#define SysADCMeasureLenght (5U)
#define SysADC_TempS1       (3)// pin 16 adc channel 3
#define SysADC_TempS2       (10)// pin 13 adc channel 10
#define SysADC_VRef         (1)// pin 1 adc channel 1


/*******************************************************************************
 * Pin Definitions
 *****************************************************************************/
#define Syspin_nReload         (12)
#define Syspin_RESET           (5)
#define Syspin_SDA             (4)
#define Syspin_SCL             (0)
#define Syspin_UART_TX         (21)
#define Syspin_UART_RX         (20)
#define Syspin_nReady          (2)
#define Syspin_nLink           (11)
#define Syspin_TempS1          (16)// pin 16 adc channel 3
#define Syspin_TempS2          (13)// pin 13 adc channel 10
#define Syspin_Botoeira        (9)
#define Syspin_SensorDeFluxo   (8)
#define Syspin_Pump            (17)
#define Syspin_VRef            (1)// pin 1 adc channel 1


/*******************************************************************************
 * APP Definitions
 *****************************************************************************/

 /*******************************************************************************
 * Tasks Definitions
 *****************************************************************************/
#define Sys_task_max            10
#define Sys_task_name_length    20

#endif

#endif